Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: AsyncStream offers a initialization strategy that provides a method of yielding values into iteration.
ja: AsyncStreamは、ある初期化戦略を申し出ます、それは反復へと値を生み出す手法を提供するものです。

source: Asynchronous calls are another type of API that typically escape their closure arguments.
ja: 非同期呼び出しは別の種類のAPIで、それは一般的にそれらのクロージャ引数を脱出させます。

source: Asynchronously advances to the next element and returns it, or ends the sequence if there is no next element.
ja: 非同期に次の要素に前進して、それを返します、または次の要素がないならばそのシーケンスを終了します。

source: At least one of the sequences must be finite.
ja: 少なくともシーケンスのうちの一方は有限でなければなりません。

source: At the call site, this looks like:
ja: 呼び出し場所で、これは次のように見えます：

source: At this point, next() is ready to receive the next value from the base sequence.
ja: この時点で、next()は次の要素を基底シーケンスから受け取る準備ができています。

source: Attempt to cancel the task.
ja: タスクの取り消しを試みます。

source: Attempting to access an element by using an index outside the bounds of the slice may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to access an element by using an index outside the bounds of the slice’s indices may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスのもつインデックスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to remove more elements than exist in the collection triggers a runtime error.
ja: コレクションの中に存在するより多くの要素の削除を試みることは実行時エラーの引き金となります。

source: Available when ArrayLiteralElement is Element.
ja: ArrayLiteralElementがElementである時に利用可能です。

source: Available when Element conforms to Comparable.
ja: ElementがComparableに準拠する時に利用可能です。

source: Available when Element conforms to Equatable.
ja: ElementがEquatableに準拠する時に利用可能です。

source: Available when Element is String.
ja: ElementがStringである時に利用可能です。

source: Available when Element is UInt8.
ja: ElementがUInt8である時に利用可能です。

source: Available when ExtendedGraphemeClusterLiteralType is StringLiteralType.
ja: ExtendedGraphemeClusterLiteralTypeがStringLiteralTypeである時に利用可能です。

source: Available when ExtendedGraphemeClusterLiteralType is UnicodeScalarLiteralType.
ja: ExtendedGraphemeClusterLiteralTypeがUnicodeScalarLiteralTypeである時に利用可能です。

source: Available when Indices is DefaultIndices<Self>.
ja: IndicesがDefaultIndices<Self>である時に利用可能です。

source: Available when Iterator is IndexingIterator<Self>.
ja: IteratorがIndexingIterator<Self>である時に利用可能です。

source: Available when RawSignificand conforms to FixedWidthInteger.
ja: RawSignificandがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when StringInterpolation is DefaultStringInterpolation.
ja: StringInterpolationがDefaultStringInterpolationである時に利用可能です。

source: Available when SubSequence is Slice<Self>.
ja: SubSequenceがSlice<Self>である時に利用可能です。

source: Available when Base conforms to BidirectionalCollection and Base.Element conforms to BidirectionalCollection.
ja: BaseがBidirectionalCollectionに準拠するそしてBase.ElementがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base conforms to Collection and Base.Element conforms to Collection.
ja: BaseがCollectionに準拠するそしてBase.ElementがCollectionに準拠する時に利用可能です。

source: Available when Base conforms to Collection, Base.Element conforms to Collection, Base.Index conforms to Hashable, and Base.Element.Index conforms to Hashable.
ja: BaseがCollectionに準拠する、Base.ElementがCollectionに準拠する、Base.IndexがHashableに準拠する、そしてBase.Element.IndexがHashableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Comparable.
ja: Base.ElementがComparableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Equatable.
ja: Base.ElementがEquatableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Sequence.
ja: Base.ElementがSequenceに準拠する時に利用可能です。

source: Available when Base.Element conforms to StringProtocol.
ja: Base.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to Comparable.
ja: Base.Element.ElementがComparableに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to Equatable.
ja: Base.Element.ElementがEquatableに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to Sequence.
ja: Base.Element.ElementがSequenceに準拠する時に利用可能です。

source: Available when Base.Element.Element conforms to StringProtocol.
ja: Base.Element.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Bound conforms to Decodable.
ja: BoundがDecodableに準拠する時に利用可能。

source: Available when Bound conforms to Encodable.
ja: BoundがEncodableに準拠する時に利用可能。

source: Available when Bound conforms to Equatable, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがEquatableに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Hashable, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがHashableに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Hashable.
ja: BoundがHashableに準拠する時に利用可能です。

source: Available when Bound conforms to Sequence, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがSequenceに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to Strideable and Bound.Stride conforms to SignedInteger.
ja: BoundがStrideableに準拠するそしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound conforms to StringProtocol, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがStringProtocolに準拠する、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when Bound is Int.
ja: BoundがIntである時に利用可能です。

source: Available when Bound is String, Bound conforms to Strideable, and Bound.Stride conforms to SignedInteger.
ja: BoundがStringである、BoundがStrideableに準拠する、そしてBound.StrideがSignedIntegerに準拠する時に利用可能です。

source: Available when ChangeElement conforms to Decodable and Encodable.
ja: ChangeElementがDecodableとEncodableに準拠する場合に利用可能です。

source: Available when ChangeElement conforms to Equatable.
ja: ChangeElementがEquatableに準拠する場合に利用可能です。

source: Available when ChangeElement conforms to Hashable.
ja: ChangeElementがHashableに準拠する場合に利用可能です。

source: Available when Element conforms to Decodable.
ja: ElementがDecodableに準拠する時に利用可能です。

source: Available when Element conforms to DecodableWithConfiguration.
ja: ElementがDecodableWithConfigurationに準拠する時に利用可能です。

source: Available when Element conforms to Encodable.
ja: ElementがEncodableに準拠する時に利用可能です。

source: Available when Element conforms to EncodableWithConfiguration.
ja: ElementがEncodableWithConfigurationに準拠する時に利用可能です。

source: Available when Element conforms to Hashable.
ja: ElementがHashableに準拠する時に利用可能です。

source: Available when Element conforms to MLDataValueConvertible.
ja: ElementがMLDataValueConvertibleに準拠する時に利用可能です。

source: Available when Element conforms to Sequence.
ja: ElementがSequenceに準拠する時に利用可能です。

source: Available when Element conforms to StringProtocol.
ja: ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Element is Double.
ja: ElementがDoubleである時に利用可能です。

source: Available when Element is Float.
ja: ElementがFloatである時に利用可能です。

source: Available when Element is MLDataValue.
ja: ElementがMLDataValueである時に利用可能です。

source: Available when ElementOfResult conforms to Comparable.
ja: ElementOfResultがComparableに準拠する時に利用可能です。

source: Available when ElementOfResult conforms to Equatable.
ja: ElementOfResultがEquatableに準拠する時に利用可能です。

source: Available when Elements conforms to BidirectionalCollection.
ja: ElementsがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Elements.Element conforms to Comparable.
ja: Elements.ElementがComparableに準拠する時に利用可能です。

source: Available when Elements.Element conforms to Equatable.
ja: Elements.ElementがEquatableに準拠する時に利用可能です。

source: Available when Elements.Element conforms to Sequence.
ja: Elements.ElementがSequenceに準拠する時に利用可能です。

source: Available when Elements.Element conforms to StringProtocol.
ja: Elements.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Elements.Index conforms to Comparable.
ja: Elements.IndexがComparableに準拠する時に利用可能です。

source: Available when Elements.Index conforms to Equatable and Elements conforms to BidirectionalCollection.
ja: Elements.IndexがEquatableに準拠するそしてElementsがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Elements.Index conforms to Equatable.
ja: Elements.IndexがEquatableに準拠する時に利用可能です。

source: Available when Elements.Index conforms to Sequence.
ja: Elements.IndexがSequenceに準拠する時に利用可能です。

source: Available when Elements.Index conforms to StringProtocol.
ja: Elements.IndexがStringProtocolに準拠する時に利用可能です。

source: Available when Elements.Index is String and Elements conforms to BidirectionalCollection.
ja: Elements.IndexがStringであるそしてElementsがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when FlattenSequence.Element conforms to Comparable.
ja: FlattenSequence.ElementがComparableに準拠する時に利用可能です。

source: Available when FlattenSequence.Element conforms to Equatable, Base conforms to BidirectionalCollection, and Base.Element conforms to BidirectionalCollection.
ja: FlattenSequence.ElementがEquatableに準拠するそしてBaseがBidirectionalCollectionに準拠する、そしてBase.ElementがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when FlattenSequence.Element conforms to Equatable, Base conforms to Collection, and Base.Element conforms to Collection.
ja: FlattenSequence.ElementがEquatableに準拠する、BaseがCollectionに準拠する、そしてBase.ElementがCollectionに準拠する時に利用可能です。

source: Available when FlattenSequence.Element conforms to Equatable.
ja: FlattenSequence.ElementがEquatableに準拠する時に利用可能です。

source: Available when FlattenSequence.Element conforms to Sequence.
ja: FlattenSequence.ElementがSequenceに準拠する時に利用可能です。

source: Available when FlattenSequence.Element conforms to StringProtocol.
ja: FlattenSequence.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when FlattenSequence.Element is String, Base conforms to BidirectionalCollection, and Base.Element conforms to BidirectionalCollection.
ja: FlattenSequence.ElementがStringである、BaseがBidirectionalCollectionに準拠する、そしてBase.ElementがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Key conforms to Comparable.
ja: KeyがComparableに準拠する場合に利用可能です。

source: Available when Key conforms to Decodable and Value conforms to Decodable.
ja: KeyがDecodableに準拠するそしてValueがDecodableに準拠する時に利用可能です。

source: Available when Key conforms to Encodable and Value conforms to Encodable.
ja: KeyがEncodableに準拠するそしてValueがEncodableに準拠する時に利用可能です。

source: Available when Key conforms to Equatable.
ja: KeyがEquatableに準拠する時に利用可能です。

source: Available when Key conforms to MLDataValueConvertible and Value conforms to MLDataValueConvertible.
ja: KeyがMLDataValueConvertibleに準拠するそしてValueがMLDataValueConvertibleに準拠する時に利用可能です。

source: Available when Key conforms to Sequence.
ja: KeyがSequenceに準拠する場合に利用可能です。

source: Available when Key conforms to StringProtocol.
ja: KeyがStringProtocolに準拠する時に利用可能です。

source: Available when Key is NSAttributedString.Key and Value is Any.
ja: KeyがNSAttributedString.KeyであるそしてValueがAnyである時に利用可能です。

source: Available when SegmentOfResult.Element conforms to Comparable.
ja: SegmentOfResult.ElementがComparableに準拠する時に利用可能です。

source: Available when SegmentOfResult.Element conforms to Equatable.
ja: SegmentOfResult.ElementがEquatableに準拠する時に利用可能です。

source: Available when Self conforms to AnyObject.
ja: SelfがAnyObjectに準拠する時に利用可能です。

source: Available when Self conforms to ExpressibleByIntegerLiteral.
ja: SelfがExpressibleByIntegerLiteralに準拠する場合に利用可能です。

source: Available when Self conforms to FixedWidthInteger.
ja: SelfがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when Self conforms to _ExpressibleByBuiltinIntegerLiteral.
ja: Selfが_ExpressibleByBuiltinIntegerLiteralに準拠する時に利用可能です。

source: Available when Self is SubSequence.
ja: SelfがSubSequenceである時に利用可能です。

source: Available when Self is AnyKeyPath.
ja: SelfがAnyKeyPathである時に利用可能です。

source: Available when Success is Never and Failure is Never.
ja: SuccessがNeverであるそしてFailureがNeverである時に利用可能です。

source: Available when Transformed conforms to Comparable.
ja: TransformedがComparableに準拠する場合に利用可能です。

source: Available when Transformed conforms to Equatable.
ja: TransformedがEquatableに準拠する時に利用可能です。

source: Available when Value conforms to Comparable.
ja: ValueがComparableに準拠する場合に利用可能です。

source: Available when Value conforms to Equatable.
ja: ValueがEquatableに準拠する時に利用可能です。

source: Available when Value conforms to Hashable.
ja: ValueがHashableに準拠する時に利用可能です。

source: Available when Value conforms to Sequence.
ja: ValueがSequenceに準拠する時に利用可能です。

source: Available when Value conforms to StringProtocol.
ja: ValueがStringProtocolに準拠する時に利用可能です。

source: Basic Arithmetic
ja: 基本算術

source: Basic Behaviors
ja: 基本の挙動

source: Basic Values
ja: 基本的な値

source: Because Array is the default type for an array literal, without writing any other code, you can declare an array with a particular element type by providing one or more values.
ja: Arrayは配列リテラルのための省略時の型なので、なんら他のコードを書くことなく、あなたはひとつ以上の値を提供することによって特定の要素型を持つ配列を宣言できます。

source: Because CollectionOfTwo doesn’t define its own makeIterator() method or Iterator associated type, it uses the default iterator type, IndexingIterator.
ja: CollectionOfTwoは独自のmakeIterator()メソッドまたはIterator関連型を定義しないことから、それは省略時のイテレータ型、IndexingIteratorを使います。

source: Because IntegerRef is a class, its instances can be compared using the identical-to operator (===).
ja: IntegerRefがクラスであるので、それのインスタンスは同一性演算子（===）を使って比較されることができます。

source: Because Cocoa methods with errors parameters are imported as throwing methods, you handle them using Swift's do-catch statement.
ja: エラーパラメータを持つCocoaメソッドはスローメソッドとしてインポートされることから、あなたはそれらをSwiftのdo-catch文で処理できます。

source: Because NaN compares not less than nor greater than any value, this method returns false when called on NaN or when NaN is passed as other.
ja: NaNはあらゆる値より少なくもないし大きくもないと比較されるので、このメソッドは、NaN上で呼ばれた時またはNaNがotherとして渡された時にfalseを返します。

source: Because NaN is incomparable with any value, this method returns false when called on NaN or when NaN is passed as other.
ja: NaNはあらゆる値と比較可能でないので、このメソッドは、NaN上で呼ばれた時またはNaNがotherとして渡された時にfalseを返します。

source: Because NaN is not equal to any value, including NaN, use this property instead of the equal-to operator (==) or not-equal-to operator (!=) to test whether a value is or is not NaN.
ja: NaNは、NaNを含めてあらゆる値と等しくないので、同等演算子（==）または不等演算子（!=）の代わりにこのプロパティを使うことで、ある値がNaNであるのかまたはないのかをテストしてください。

source: Because Swift can’t guarantee at compile time that these methods and properties are actually available on an AnyObject instance’s underlying type, these @objc symbols are available as implicitly unwrapped optional methods and properties, respectively.
ja: SwiftはそれらのメソッドやプロパティがAnyObjectインスタンスの下に横たわる型で実際に利用可能であるとコンパイル時に保証しないため、これら@objcシンボルは暗黙的にアンラップされるオプショナルのメソッドやプロパティとしてそれぞれ利用可能です。

source: Because a NaN always compares not equal to itself, to test whether a floating-point value is NaN, use its isNaN property instead of the equal-to operator (==).
ja: NaNは常にそれ自身に対して等しくないと比較されることから、浮動小数点値がNaNかどうかテストするには、それのisNaNプロパティを同等演算子（==）の代わりに使ってください。

source: Because a closed range cannot represent an empty range, this property is always false.
ja: 完結範囲は空の範囲を表すことができないので、このプロパティは常にfalseです。

source: Because a closed range includes its upper bound, a closed range whose lower bound is equal to the upper bound contains that value.
ja: 完結範囲はそれの上側の境界を含むことから、それの下側の境界が上側の境界と等しい完結範囲はその値を含みます。

source: Because a closed range includes its upper bound, the ranges in the following example also overlap:
ja: 完結範囲はそれの上方の境界を含むことから、以下の例の範囲もまた重なります：

source: Because any arbitrary subclass of NSArray can become an Array, there are no guarantees about representation or efficiency in this case.
ja: 何であれ随意のNSArrayのサブクラスがArrayになることが可能であるので、表現や効率についてはこの場合保証されません。

source: Because arrays increase their allocated capacity using an exponential strategy, appending a single element to an array is an O(1) operation when averaged over many calls to the append(_:) method.
ja: 配列はそれらの割り当てられた容量を指数戦略で増やすので、ある単一の要素を配列に加えることは、append(_:)メソッドへの多くの呼び出しにわたって平均した場合は、O(1)演算です。

source: Because both Swift methods have the same behavior, they share the same page in the documentation.
ja: 両方のSwiftメソッドは同じ挙動を持つことから、それらは文書化において同じページを共有します。

source: Because both types have the same interface, you can replace one with the other in most circumstances, without making other changes.
ja: 両方の型は同じインターフェイスを持つため、あなたは多くの状況で一方を他方で置き換えることが、他の変更をすることなく可能です。

source: Because calculating the average of the observations involves combining every value of the tempsFahrenheit array, any NaN values cause the result to also be NaN, as seen in this example:
ja: 観測の平均の算出はtempsFahrenheit配列のすべての値を足し合わせることを必然的に含むことから、何らかのNaN値はまたNaNになるという結果を引き起こします、この例で見られるように：

source: Because case conversion can result in multiple characters, the result of lowercased() is a string.
ja: ケース変換が複数の文字という結果になり得ることから、lowercased()の結果はある文字列です。

source: Because case conversion can result in multiple characters, the result of uppercased() is a string.
ja: ケース変換が複数の文字という結果になり得ることから、uppercased()の結果はある文字列です。

source: Because default implementations of the remainder of the relational operators are provided by the standard library, you’ll be able to use !=, >, <=, and >= with instances of your type without any further code.
ja: 関係演算子の残りの省略時の実装は標準ライブラリによって提供されることから、あなたは!=、>、<=、そして>=をあなたの型のインスタンスにおいてなんらこれ以上のコード無しに使うことができます。

source: Because each character in a string can be made up of one or more Unicode scalar values, the number of characters in a string may not match the length of the Unicode scalar value representation or the length of the string in a particular binary representation.
ja: 文字列中の各文字はひとつ以上のユニコードスカラー値から成り立つので、ある文字列の文字数はユニコードスカラー値表現の長さ、または特定のバイナリ表現での文字列の長さと一致しないかもしれません。

source: Because floating-point types such as Float and Double are their own Stride types, they cannot be used as the bounds of a countable range.
ja: 浮動小数点型、例えばFloatおよびDoubleは、それら独自のStride型であるので、それらは可付番範囲の境界として使われることはできません。

source: Because many functions and initializers fully specify the types of their parameters, you can often use an array literal with or without elements as a parameter.
ja: 多くの関数とイニシャライザはそれらのパラメータの型を完全に指定することから、あなたはしばしば要素のあるまたはない配列リテラルをパラメータとして使うことができます。

source: Because structures are value types—unlike classes—local changes to a structure aren't visible to the rest of your app unless you intentionally communicate those changes as part of the flow of your app.
ja: 構造体が値型であることから — クラスとは違い — 構造体への局所的変更はあなたのアプリの残りには不可視です、あなたが意図的にそれら変更をあなたのアプリのフローの一部として伝達しない限りは。

source: Because testing whether one NaN is equal to another NaN results in false, use the isNaN property to test whether a value is NaN.
ja: あるNaNが別のNaNと等しいかどうかテストすることはfalseの結果になることから、isNaNプロパティを使うことである値がNaNかどうかテストしてください。

source: Because the GridPoint type is not hashable yet, it can’t be used in a set.
ja: GridPoint型はまだハッシュ可能でないことから、それは集合において使用できません。

source: Because the String(reflecting:) initializer works for instances of any type, returning an instance’s debugDescription if the value passed conforms to CustomDebugStringConvertible, accessing a type’s debugDescription property directly or using CustomDebugStringConvertible as a generic constraint is discouraged.
ja: String(reflecting:)イニシャライザがあらゆる型のインスタンスに対して働いて、渡される値がdebugDescriptionに準拠するならばインスタンスのCustomDebugStringConvertibleを返すので、ある型のもつdebugDescriptionプロパティに直にアクセスすることや、総称体制約としてCustomDebugStringConvertibleを使うことは推奨されません。

source: Because the Cake structure has fields with unnamed types, you use the .init initializers (allowed due to Swift's type inference) to set the initial value for each of the structure’s unnamed fields.
ja: Cake構造体は無名型でのフィールドを持つことから、あなたは.initイニシャライザ（Swiftの持つ型推論によって与えられるもの）を使用して、初期値をその構造体の持つ無名フィールドの各々に設定します。

source: Because the Error protocol has no requirements of its own, you can declare conformance on any custom type you create.
ja: Errorプロトコルはそれ自身の要件を持たないので、あなたは準拠を宣言することがあなたが作成するあらゆるあつらえの型で可能です。

source: Because the hypotenuse(_:_:) function uses a generic parameter constrained to the FloatingPoint protocol, you can call it using any floating-point type.
ja: hypotenuse(_:_:)関数はFloatingPointプロトコルに制約された総称体パラメータを使うので、あなたはそれを呼び出すことがあらゆる浮動小数点型を使って行えます。

source: Because the myID property is declared as a constant, it can't change locally.
ja: なぜならmyIDプロパティは定数として宣言されるからです、それはローカルに変更できません。

source: Because the PenPalRecord structure doesn't control the identity of the underlying database records, there's no risk that the changes made to local PenPalRecord instances accidentally change values in the database.
ja: PenPalRecord構造体が基礎をなすデータベースレコードの同一性を制御しないことから、ローカルのPenPalRecordインスタンスになされる変更が誤って値をデータベースにおいて変更する危険はありません。

source: Because the Int8 type can represent 127 at maximum, the attempt to create z with a value of 1000 results in a runtime error.
ja: Int8型は、最大で127を表せることから、zを1000の値で作成する試みは、実行時エラーという結果になります。

source: Because the first field of the Cake structure is unnamed, its initializer’s first parameter doesn't have a label.
ja: Cake構造体の最初のフィールドが無名であるため、それのイニシャライザの持つ最初のパラメータはラベルを持ちません。

source: Because the generated header is part of the framework’s public interface, only declarations marked with the public or open modifier appear in the generated header for a framework target.
ja: 生成されたヘッダがフレームワークのパブリックインターフェイスの一部であることから、publicまたはopen修飾子で印された宣言だけがフレームワークターゲットに対する生成ヘッダに現れます。

source: Because the predicate throws when it receives 2 from the base sequence, this example throws without ever printing anything.
ja: 述部はそれが2を基底シーケンスから受け取る時にスローすることから、この例は決して何かを印字することなくスローします。

source: Because the quotient is representable as an Int, the division succeeds.
ja: 商がIntとして表現可能であることから、除算は成功します。

source: Because the result of this nil-coalescing operation is itself an optional value, you can chain default values by using ?? multiple times.
ja: このnil合体演算の結果がそれ自体オプショナル値であることから、あなたは幾らかの省略時の値を??を複数回使うことで連鎖することができます。

source: Because the tasks you add to a group with this method are nonthrowing, those tasks can’t respond to cancellation by throwing CancellationError.
ja: あなたがグループにこのメソッドで加えるタスクはスローしないことから、それらタスクは、CancellationErrorをスローすることによって取り消しに応答できません。

source: Because there is no key for 4, the closure returns nil in this case, which compactMap(_:) omits from the transformed asynchronous sequence.
ja: 4に対するキーがないことから、クロージャはnilをその場合には返します、それはcompactMap(_:)がこの変換された非同期シーケンスから省きます。

source: Because this initializer does not perform any checks, it should be used as an optimization only when you are absolutely certain that lower is less than or equal to upper.
ja: このイニシャライザは何ら確認を行わないので、それは、あなたがlowerがupperより少ないか等しいことを絶対に確信している場合にのみ１つの最適化として使われるべきです。

source: Because unions in C use the same base memory address for all of their fields, all of the computed properties in a union imported by Swift use the same underlying memory.
ja: Cでの共用体は同じ基盤メモリアドレスをすべてのそれのフィールドに対して使うことから、スウィフトによってインポートされる共用体の中の計算プロパティのすべては同じ基礎をなすメモリを使います。

source: Because weak and unowned references cannot be the only reference to an object, passing a weak or unowned reference as object always results in false.
ja: 弱いおよび非所有の参照は、あるオブジェクトに対する唯一の参照ではありえないので、弱いまたは非所有参照をobjectとして渡すことは常にfalseという結果になります。

source: Before appending, the array allocates new storage that is large enough store the resulting elements.
ja: 追加の前に、この配列は新しいストレージを割り当てます、それは結果として生じる要素らを格納するのに十分に大きいものです。

source: Before shifting, the masking left shift operator masks the shift to this range.
ja: シフトする前に、マスク左シフト演算子は、シフトをマスクしてこの範囲にします。

source: Before shifting, the masking right shift operator masks the shift to this range.
ja: シフトする前に、マスク右シフト演算子は、シフトをマスクしてこの範囲にします。
